[
  {
    "post_id": "1mb45ub",
    "text": "I apologize if this is toxic but I am rooting for this man's failure as an entity. I apologize if this is toxic but I am rooting for this man's failure as an entity. I was weirded out when i started seeing Mr. Beast merch in local stores. I was appalled when I found out how \"big of a deal he is\" yet how morally bankrupt his brand is, how it's \"okay\" because he paid for surgeries. I committed to ignoring his ass when Beast Games started and I mostly evade him during my internet searches.\n\nBetween him and Donald Trump I am aggressively tired of wealthy people getting away with so much sh-t and putting their faces on everything \"good\" in the world. I despise that he is popular with children and that his brand is built off \"being a nice guy.\" Nobody is flawless, perfect, or worth this much attention - yet people like Mr. Beast, Pewdiepie, and Logan Paul build this cult of personality around themselves and people keep getting sucked in.\n\nI can only root for him getting caught for tax evasion or one of his cronies coming out with some kind of watergate scandal about him.",
    "created_utc": "2025-07-28T02:09:27",
    "subreddit": "copypasta",
    "permalink": "https://www.reddit.com/r/copypasta/comments/1mb45ub/i_apologize_if_this_is_toxic_but_i_am_rooting_for/",
    "emotion": "disgust",
    "score": 0.7069,
    "all_emotion_scores": {
      "anger": 0.1873,
      "disgust": 0.7069,
      "fear": 0.0118,
      "joy": 0.0008,
      "neutral": 0.0177,
      "sadness": 0.0054,
      "surprise": 0.0701
    },
    "EventProcessedUtcTime": "2025-07-28T02:16:11.1685754Z",
    "PartitionId": 0,
    "EventEnqueuedUtcTime": "2025-07-28T02:09:39.1260000Z"
  },
  {
    "post_id": "1mb47z2",
    "text": "Ohio State president says Ivy League trying to survive Trump",
    "created_utc": "2025-07-28T02:12:12",
    "subreddit": "politics",
    "permalink": "https://www.reddit.com/r/politics/comments/1mb47z2/ohio_state_president_says_ivy_league_trying_to/",
    "emotion": "neutral",
    "score": 0.7745,
    "all_emotion_scores": {
      "anger": 0.0162,
      "disgust": 0.0127,
      "fear": 0.0535,
      "joy": 0.0211,
      "neutral": 0.7745,
      "sadness": 0.0675,
      "surprise": 0.0544
    },
    "EventProcessedUtcTime": "2025-07-28T02:16:11.1689845Z",
    "PartitionId": 0,
    "EventEnqueuedUtcTime": "2025-07-28T02:12:23.1590000Z"
  },
  {
    "post_id": "1mb483q",
    "text": "Just got back from taking the kids on the childhood tour. (Long reminiscent rambling ahead) I grew up in Stockton Springs, and Maine has always held a place in my heart ever since mom passed and I was forced to move at 15.\n\nWe finally took the kids to see where I grew up. We stayed on Cape Jellison and saw wildlife damn near every day out our kitchen window. Several deer, some with fauns, turkeys, skunks, a woodchuck and a porcupine made their presence known at some point each morning. I took them up Sandy Point Beach, and was upset that someone let the cat out of the bag at how quiet and unattended it used to be, but we had fun beachcombing and rescuing moon jellies until check in time.\n\nWe circled the cape, me waxing poetic how I used to have a crush on the kid who lived here, and the kid who lived here was a real jerk, and here’s where my best friend lived. We picked lupine pods, and enjoyed the sound of the rattling seeds ready to spring forth. We collected so many seeds, crunching and splitting the pods open, releasing those black little gems. We drove up to see mom at Mt. Prospect cemetery and planted a few for her there. We visited Fort Point, and I remembered how I envied my classmate who used to live in the keeper’s house as her family took care of the park.\n\nWe dodged ruts up to Fletcher’s Hill and picked blueberries as we looked over the bay. We ate dinner at Just Barb’s, where I got recognized by the girl at the counter who was a classmate of mine, and knew me instantly after all these years.\n\nWe did the neighboring towns too- Antiques in Searsport after lunch at Angler’s. Reny’s, Co-op, and Main Street shopping in Belfast with a special stop in the hardware store to visit an old and dear friend.\nWe did dinner at Young’s, and I personally got to teach the kids how to crack a lobster bare handed, no tools or pickers, and with the lobster uncut! We even found an honest to goodness pie lady on Rte 1 and made fast friends for the week.\nWe did Bucksport with the “new” bridge, went up the observatory (wow!) and showed them how fun it is to explore Fort Knox as a kid. \n\nI finally got to explore places I’d never been- we did a loop around Verona Island, and stopped in Sweet Cheeks bakery. We drove all the way up to the thunder hole where I stood in awe! I couldn’t believe I was only seeing it now for the first time!\nDinner was in “Bah-Hahbah” to illustrate the difference of what they’ve been seeing, the humble town of mine vs the snooty tourist attraction that is Bar Harbor. It wasn’t lost on them. In fact, it melted my heart when after seeing the stark contrast of the two sides of Maine, my youngest piped “Mom? Thank you for taking us on a REAL Maine Vacation and not a tourist one.” Dear lord I think I shed tears on that.\n\nWe got souvenirs of course- me, a watercolor from a local artist. It made me laugh because it’s of a man painting a farmhouse. I told the artist how mom’s local artist friend painted our house! So now I have a local artist’s painting of a local artist painting my Maine home! I also picked up a playable trumpet in decent shape, and a 12 gallon turquoise glass jug, because why not?\n\nOf course we stopped by my old place. It’s a working farm and farm stand now, mom would be glad the land is being worked, and proud they’re making a go of it. We met the folks and they gave us a tour of the inside. Making that connection healed a lot for me in a strange way.\n\nAt the end of it all, we were invited to the local street dance where they served red snappers and moxie floats! We did the Macarena, the cha-cha slide, the limbo, and a cake walk for us old folks.\n\nThis was unequivocally the best vacation I’ve been on in absolute ages. It meant the world to me that Maine is still there if you look for it. Thank you all so much for sharing your state with this Mainer turned flat-lander. It was so good for my heart to close some doors, make peace, and teach the next generation what it’s all about. ❤️",
    "created_utc": "2025-07-28T02:12:24",
    "subreddit": "Maine",
    "permalink": "https://www.reddit.com/r/Maine/comments/1mb483q/just_got_back_from_taking_the_kids_on_the/",
    "emotion": "neutral",
    "score": 0.8541,
    "all_emotion_scores": {
      "anger": 0.0135,
      "disgust": 0.0148,
      "fear": 0.0701,
      "joy": 0.0126,
      "neutral": 0.8541,
      "sadness": 0.0237,
      "surprise": 0.0113
    },
    "EventProcessedUtcTime": "2025-07-28T02:16:11.1690305Z",
    "PartitionId": 0,
    "EventEnqueuedUtcTime": "2025-07-28T02:12:35.3940000Z"
  },
  {
    "post_id": "1mb486i",
    "text": "Trump Now Aims to Prosecute Oprah in Latest Epstein Distraction",
    "created_utc": "2025-07-28T02:12:30",
    "subreddit": "Full_news",
    "permalink": "https://www.reddit.com/r/Full_news/comments/1mb486i/trump_now_aims_to_prosecute_oprah_in_latest/",
    "emotion": "anger",
    "score": 0.3357,
    "all_emotion_scores": {
      "anger": 0.3357,
      "disgust": 0.155,
      "fear": 0.2494,
      "joy": 0.0082,
      "neutral": 0.0611,
      "sadness": 0.1861,
      "surprise": 0.0044
    },
    "EventProcessedUtcTime": "2025-07-28T02:16:11.1690730Z",
    "PartitionId": 0,
    "EventEnqueuedUtcTime": "2025-07-28T02:12:42.2690000Z"
  },
  {
    "post_id": "1mb48un",
    "text": "Trump regime  reverses rule that would have removed medical debt from credit reports",
    "created_utc": "2025-07-28T02:13:23",
    "subreddit": "somethingiswrong2024",
    "permalink": "https://www.reddit.com/r/somethingiswrong2024/comments/1mb48un/trump_regime_reverses_rule_that_would_have/",
    "emotion": "sadness",
    "score": 0.4248,
    "all_emotion_scores": {
      "anger": 0.0798,
      "disgust": 0.006,
      "fear": 0.0461,
      "joy": 0.0419,
      "neutral": 0.2372,
      "sadness": 0.4248,
      "surprise": 0.1642
    },
    "EventProcessedUtcTime": "2025-07-28T02:16:11.1690972Z",
    "PartitionId": 0,
    "EventEnqueuedUtcTime": "2025-07-28T02:13:34.1130000Z"
  },
  {
    "post_id": "1mb491x",
    "text": "MAGA Movement Controversy Not just about Trump",
    "created_utc": "2025-07-28T02:13:37",
    "subreddit": "TrumpNicknames",
    "permalink": "https://www.reddit.com/r/TrumpNicknames/comments/1mb491x/maga_movement_controversy/",
    "emotion": "neutral",
    "score": 0.4055,
    "all_emotion_scores": {
      "anger": 0.3677,
      "disgust": 0.1445,
      "fear": 0.0297,
      "joy": 0.0122,
      "neutral": 0.4055,
      "sadness": 0.0146,
      "surprise": 0.0258
    },
    "EventProcessedUtcTime": "2025-07-28T02:16:11.1691206Z",
    "PartitionId": 0,
    "EventEnqueuedUtcTime": "2025-07-28T02:13:50.1600000Z"
  },
  {
    "post_id": "1mb49eu",
    "text": "New executive order on involuntary institutionalization Its wild to me how some people who are on the left but are comfortable enough to have never had to deal with psychiatry first-hand are loosing their minds at how dystopian and vague \"danger to self, others, or inability to care for self\" are as grounds for forced hospitalization when they're in Trump's executive order as if those aren't the exact same standards every single state forced hospitalization law uses. Good to see at least some folks waking up to how inhumane this is though",
    "created_utc": "2025-07-28T02:14:06",
    "subreddit": "Antipsychiatry",
    "permalink": "https://www.reddit.com/r/Antipsychiatry/comments/1mb49eu/new_executive_order_on_involuntary/",
    "emotion": "neutral",
    "score": 0.5841,
    "all_emotion_scores": {
      "anger": 0.0221,
      "disgust": 0.0278,
      "fear": 0.2855,
      "joy": 0.0371,
      "neutral": 0.5841,
      "sadness": 0.0076,
      "surprise": 0.0357
    },
    "EventProcessedUtcTime": "2025-07-28T02:16:11.1691438Z",
    "PartitionId": 0,
    "EventEnqueuedUtcTime": "2025-07-28T02:14:17.0980000Z"
  },
  {
    "post_id": "1mb49m2",
    "text": "I know Who The Biblical Final Antichrist is Since 2020 just after COVID 19 Started a few months into it I had A Vivid Dream that Donald Trump's Going House to House giving a Fake COVID Vaccine.\n\nIt has people Cheering him in for it until they get It and He ended up Sexual Abusing People Both Men and Women who all ended up Asking for Help they asked me for help of all people because Trump is coming to My house and I hear my Female roommate who's Deaf go to the Gate to let him in but I Stopped Her Pulling her back behind me and I stepped out the Gate and I take the Syringes Trump is holding filled with a Black Goo in Syringes I Jabbed them in his Eyes and then crushed his skull and then he starts turning into a Ball of Dragon Scales that ended up making Him A 7 Headed Red Dragon.\n\n\nHe bites me in the Dream and it wakes me up but I still feel teeth in my body and I tried to forget it but Months later I'm awake and outside smoking a cigarette and I started hearing music in the sky from heaven with Peter Steel singing Donald Trump's the Antichrist and Donald Trump's A Chump.\n\nThen two days later it gets stranger I'm Outside smoking a cigarette again and I Hear Donald Trump's voice in the sky saying he's Donald Trump and he is the Antichrist Looking for a Man Child to give Me a Grievous Head wound to become a seven-headed red dragon and I go to the street and flipped the voice off and he replied to me Fuck You Man Child I know I'm a Man Child but not sure I'm The Man Child of Revelation's 12 but that's what Trump was Hinting at that I am I figured that Man Child Is Jesus Christ not anyone like me .",
    "created_utc": "2025-07-28T02:14:21",
    "subreddit": "Christianity",
    "permalink": "https://www.reddit.com/r/Christianity/comments/1mb49m2/i_know_who_the_biblical_final_antichrist_is/",
    "emotion": "anger",
    "score": 0.4825,
    "all_emotion_scores": {
      "anger": 0.4825,
      "disgust": 0.1895,
      "fear": 0.018,
      "joy": 0.006,
      "neutral": 0.1809,
      "sadness": 0.0616,
      "surprise": 0.0614
    },
    "EventProcessedUtcTime": "2025-07-28T02:16:11.1691689Z",
    "PartitionId": 0,
    "EventEnqueuedUtcTime": "2025-07-28T02:14:33.6610000Z"
  },
  {
    "post_id": "1mb49ww",
    "text": "Trump regime  reverses rule that would have removed medical debt from credit reports",
    "created_utc": "2025-07-28T02:14:44",
    "subreddit": "MeidasTouch",
    "permalink": "https://www.reddit.com/r/MeidasTouch/comments/1mb49ww/trump_regime_reverses_rule_that_would_have/",
    "emotion": "sadness",
    "score": 0.4248,
    "all_emotion_scores": {
      "anger": 0.0798,
      "disgust": 0.006,
      "fear": 0.0461,
      "joy": 0.0419,
      "neutral": 0.2372,
      "sadness": 0.4248,
      "surprise": 0.1642
    },
    "EventProcessedUtcTime": "2025-07-28T02:16:11.1691970Z",
    "PartitionId": 0,
    "EventEnqueuedUtcTime": "2025-07-28T02:14:56.5210000Z"
  },
  {
    "post_id": "1mb4an9",
    "text": "Melania Trump Heavily Involved in Epstein Scandal",
    "created_utc": "2025-07-28T02:15:42",
    "subreddit": "Law_and_Politics",
    "permalink": "https://www.reddit.com/r/Law_and_Politics/comments/1mb4an9/melania_trump_heavily_involved_in_epstein_scandal/",
    "emotion": "sadness",
    "score": 0.5862,
    "all_emotion_scores": {
      "anger": 0.0344,
      "disgust": 0.2376,
      "fear": 0.1022,
      "joy": 0.005,
      "neutral": 0.0304,
      "sadness": 0.5862,
      "surprise": 0.0042
    },
    "EventProcessedUtcTime": "2025-07-28T02:16:11.1692196Z",
    "PartitionId": 0,
    "EventEnqueuedUtcTime": "2025-07-28T02:15:53.5840000Z"
  }
]